"""
Эмулятор командной оболочки виртуальной файловой системы (VFS).

Модуль реализует минимальный прототип интерактивного режима (REPL)
в рамках первого этапа разработки. Обеспечивает базовый диалог с
пользователем, разбор введенных команд и обработку синтаксических ошибок.

Поддерживаемые команды:
    - ls: вывод содержимого текущей директории (заглушка).
    - cd: смена текущей директории (заглушка).
    - exit: завершение работы эмулятора.
"""

def cli(): 
    com_list = ["ls", "cd", "exit"]
    while True:
        line = input("VFS> ").split()
        if line[0] not in com_list:
            print("Error")
        elif line[0] == "ls":
            print(*line)
        elif line[0] == "cd":
            print(*line)
        elif line[0] == "exit":
            break
cli()